Revit 2027 API
WorksetPreview Properties
The WorksetPreview type exposes the following members.
Properties
Name | Description
Id |  Id of the workset.
IsDefaultWorkset |  Whether the workset is the default one.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Name of the workset.
Owner |  User name of the workset.
UniqueId |  UniqueId of the workset.
Top
See Also
Reference
WorksetPreview Class
Autodesk.Revit.DB Namespace